// Работа с if-else

// 1. Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
/**
 *
 * @type {number}
 */
const a = -3;
if (a === 0) {
    alert('Верно');
} else {
    alert('Неверно');
}

// 2. Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
/**
 *
 * @type {number}
 */
const a = 0;
if (a > 0) {
    alert('Верно');
} else {
    alert('Неверно');
}

// 3.  Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
/**
 *
 * @type {number}
 */
const a = 0;
if (a < 0) {
    alert('Верно');
} else {
    alert('Неверно');
}

// 4. Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
/**
 *
 * @type {number}
 */
const a = 0;
if (a >= 0) {
    alert('Верно');
} else {
    alert('Неверно');
}

// 5. Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
/**
 *
 * @type {number}
 */
const a = 0;
if (a <= 0) {
    alert('Верно');
} else {
    alert('Неверно');
}

// 6. Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
/**
 *
 * @type {number}
 */
const a = 0;
if (a != 0) {
    alert('Верно');
} else {
    alert('Неверно');
}

// 7.  Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 'test', 'тест', 3.
/**
 *
 * @type {string}
 */
const a = 'test';
if (a === 'test') {
    alert('Верно');
} else {
    alert('Неверно');
}

// 8. Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1, 3.
/**
 * 
 * @type {string}
 */
const a = '1';
if (a === '1') {
    alert('Верно');
} else {
    alert('Неверно');
}